{
  "backend/main.mo": "Motoko canister defining user profiles, intake state, playlists, OTT sessions, staff settings, and authorized CRUD operations with access control.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to impacted frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries for multiple frontend files covering hooks, components, pages, and UI behaviors.",
  "frontend/index.css": "Tailwind CSS base file defining light/dark theme CSS variables and global styling.",
  "frontend/index.html": "Minimal HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main app router defining all routes and global providers including theme, playback, and media activity.",
  "frontend/src/components/BackNavButton.tsx": "Back navigation button that triggers custom back-navigation logic via keyboard or pointer.",
  "frontend/src/components/BluetoothPairingControl.tsx": "Bluetooth control for Bose QuietComfort Ultra with connection status, error toasts, and connect/disconnect actions.",
  "frontend/src/components/BottomBars.tsx": "Layout component managing bottom padding and stacking of Now Playing and Emergency Talk bars based on activity state.",
  "frontend/src/components/DashboardDisplayModeToggle.tsx": "Dashboard-local toggle to switch between Front and Back display modes using useDisplayMode.",
  "frontend/src/components/DisplayModeToggle.tsx": "Toggle UI letting users switch between Front and Back display modes with icon buttons.",
  "frontend/src/components/EmergencyTalkBar.tsx": "Floating bar that toggles emergency talk mode, pausing or resuming audio and video.",
  "frontend/src/components/GlassTile.tsx": "Reusable glass-style card that supports click and keyboard activation for interactive tiles.",
  "frontend/src/components/HomeNavButton.tsx": "Home button that clears intake state and navigates to the root route unless already there.",
  "frontend/src/components/LocalFileAudioPlayer.tsx": "Audio player for locally selected files with play/pause, volume, timeline, and error handling.",
  "frontend/src/components/NowPlayingBar.tsx": "Now playing footer showing current item with playback controls, volume, and emergency talk restrictions.",
  "frontend/src/components/OfflineBadge.tsx": "Displays offline availability status and optional download/remove action for content.",
  "frontend/src/components/OnboardingHint.tsx": "Small glass-panel hint box displaying onboarding information with an info icon.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Dialog prompting the user to enter their name and saving the profile via API.",
  "frontend/src/components/StaffEntryGesture.tsx": "Long-press gesture that opens a staff passcode dialog and navigates to staff mode on success.",
  "frontend/src/components/TopBar.tsx": "Renders the top navigation bar with logo, language selector, display toggle, Bluetooth control, and navigation buttons.",
  "frontend/src/components/YouTubeFallbackPlayer.tsx": "Provides an embedded YouTube player fallback for audio programs, with error handling and external link opening.",
  "frontend/src/contexts/MediaActivityContext.tsx": "Context provider tracking whether video content is active and exposing a setter.",
  "frontend/src/contexts/PlaybackContext.tsx": "Manages global audio playback state, queue navigation, error handling, and safe volume enforcement.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to user identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useAudioPlayer.ts": "Implements an HTMLAudioElement wrapper with play control, metadata tracking, and detailed error handling.",
  "frontend/src/hooks/useBackNavigation.ts": "Tracks navigation history and exposes a goBack function with route-specific fallback logic.",
  "frontend/src/hooks/useBoseQuietComfortUltraBluetooth.ts": "Manages Web Bluetooth connection to Bose QuietComfort Ultra devices, handling connect, disconnect, errors, and sessionStorage state.",
  "frontend/src/hooks/useBottomBarLayout.ts": "Computes bottom bar offsets and padding based on visibility of Now Playing and Emergency bars.",
  "frontend/src/hooks/useClinicalSafety.ts": "Tracks and persists emergency talk activation state using sessionStorage.",
  "frontend/src/hooks/useDisplayMode.ts": "Stores and syncs per-route display mode across components via sessionStorage and custom events.",
  "frontend/src/hooks/useIntakeState.ts": "Manages intake form state with sessionStorage persistence and helpers for completion logic.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and helpers for Internet Identity login, identity loading, and logout with AuthClient.",
  "frontend/src/hooks/useLanguagePreference.ts": "Stores and updates user's language preference in sessionStorage.",
  "frontend/src/hooks/useMediaActivity.ts": "Exposes media activity context with safety check for provider presence.",
  "frontend/src/hooks/usePlayback.ts": "Provides access to playback context with required provider enforcement.",
  "frontend/src/hooks/useQueries.ts": "Wrapper hooks around react-query for fetching and mutating backend data via actor methods.",
  "frontend/src/hooks/useSessionWelcomeAudio.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useStaffSettings.ts": "Manages staff authentication flag with sessionStorage persistence.",
  "frontend/src/index.css": "Sets Tailwind layers, theme color variables for light/dark modes, and custom utility classes including glassmorphism and gradient backgrounds.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/Dashboard/Dashboard.tsx": "Renders the dashboard with personalized module tiles based on intake state, mood, profile, and anxiety levels.",
  "frontend/src/pages/Intake/IntakeFlow.tsx": "Implements a multi‑step intake wizard for profile, mood, vibe, and anxiety, navigating to the dashboard upon completion.",
  "frontend/src/pages/Modules/Audiobooks/Audiobooks.tsx": "Renders audiobook categories with kid/adult tabs and opens external category links based on intake profile.",
  "frontend/src/pages/Modules/Audiobooks/CategoryTile.tsx": "Displays a clickable audiobook category tile with icon, description, and external link indicator.",
  "frontend/src/pages/Modules/AudioPharmacy/AudioPharmacy.tsx": "Displays recommended audio programs, supports offline downloads, and starts playback for selected programs.",
  "frontend/src/pages/Modules/AudioPharmacy/NowPlaying.tsx": "Shows the active audio program player with volume controls, error handling, and a YouTube fallback option.",
  "frontend/src/pages/Modules/Cinema/Cinema.tsx": "Shows enabled OTT providers, saves session data, and opens provider links with a continue-watching section.",
  "frontend/src/pages/Modules/RegionalRadio/RegionalRadio.tsx": "Provides language‑based music playlists with tabbed filtering and external provider links.",
  "frontend/src/pages/Modules/VisualEscapes/VisualEscapes.tsx": "Manages visual escape videos, kids‑only content, offline playback, and modal video interactions with safety hooks.",
  "frontend/src/pages/Staff/StaffDashboard.tsx": "Staff controls for volume limits, premium toggles, OTT provider enablement, and headset battery status.",
  "frontend/src/utils/assetUrl.ts": "Utility to build correct asset URLs using the app’s base path.",
  "frontend/src/utils/externalLinks.ts": "Defines centralized external links for Spotify, YouTube, kids cartoons, and audiobooks, organized by language and category.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and clearing URL and session parameters, including hash‑based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, radii, shadows, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Stores the project’s current state, goals, architecture notes, known issues, and existing feature records for the Aspen Calm build."
}